throughput_tests_3/results_monohilo_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10000

Document Path:          /index.html
Document Length:        20224 bytes

Concurrency Level:      50
Time taken for tests:   0.018 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      2026800 bytes
HTML transferred:       2022400 bytes
Requests per second:    5685.37 [#/sec] (mean)
Time per request:       8.795 [ms] (mean)
Time per request:       0.176 [ms] (mean, across all concurrent requests)
Transfer rate:          112530.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       1
Processing:     0    6   2.4      7       8
Waiting:        0    6   2.4      7       8
Total:          1    6   2.2      7       8

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%      8
  95%      8
  98%      8
  99%      8
 100%      8 (longest request)