throughput_tests_3/results_monohilo_5000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            10000

Document Path:          /index.html
Document Length:        20224 bytes

Concurrency Level:      2500
Time taken for tests:   0.899 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      101340000 bytes
HTML transferred:       101120000 bytes
Requests per second:    5561.64 [#/sec] (mean)
Time per request:       449.508 [ms] (mean)
Time per request:       0.180 [ms] (mean, across all concurrent requests)
Transfer rate:          110081.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9  17.7      0      51
Processing:    13  151  44.5    162     215
Waiting:        0  151  44.7    162     215
Total:         63  160  30.1    164     215

Percentage of the requests served within a certain time (ms)
  50%    164
  66%    168
  75%    171
  80%    175
  90%    192
  95%    204
  98%    212
  99%    213
 100%    215 (longest request)