throughput_tests_3/results_multihilo_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      500
Time taken for tests:   0.075 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      19769000 bytes
HTML transferred:       19725000 bytes
Requests per second:    13346.86 [#/sec] (mean)
Time per request:       37.462 [ms] (mean)
Time per request:       0.075 [ms] (mean, across all concurrent requests)
Transfer rate:          257669.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10   3.0     12      14
Processing:     7   21   8.0     21      34
Waiting:        0   11   4.4     10      19
Total:         21   32   6.2     31      43

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     35
  75%     38
  80%     38
  90%     39
  95%     42
  98%     42
  99%     43
 100%     43 (longest request)