throughput_tests_3/results_multihilo_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      5000
Time taken for tests:   0.879 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      197690000 bytes
HTML transferred:       197250000 bytes
Requests per second:    11370.36 [#/sec] (mean)
Time per request:       439.740 [ms] (mean)
Time per request:       0.088 [ms] (mean, across all concurrent requests)
Transfer rate:          219512.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   31  21.4     26      88
Processing:    12   63  17.5     62     112
Waiting:        0   30  13.3     25      70
Total:         42   95  19.0     90     167

Percentage of the requests served within a certain time (ms)
  50%     90
  66%     95
  75%    100
  80%    110
  90%    120
  95%    135
  98%    140
  99%    152
 100%    167 (longest request)