throughput_tests_3/results_multihilo_2500.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      1250
Time taken for tests:   0.246 seconds
Complete requests:      2500
Failed requests:        0
Total transferred:      49422500 bytes
HTML transferred:       49312500 bytes
Requests per second:    10158.84 [#/sec] (mean)
Time per request:       123.046 [ms] (mean)
Time per request:       0.098 [ms] (mean, across all concurrent requests)
Transfer rate:          196123.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14  10.7      9      29
Processing:    22   88  42.0     99     157
Waiting:        0   82  44.3     98     150
Total:         31  102  51.1    128     174

Percentage of the requests served within a certain time (ms)
  50%    128
  66%    144
  75%    151
  80%    154
  90%    163
  95%    170
  98%    172
  99%    172
 100%    174 (longest request)